# MakesDataUnusable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedBuildIssue..::..MakesDataUnusable Method
TessellatedBuildIssue Class See Also
---
Reports whether this issue makes some data unusable ('true') or is only shows that data format conventions were broken, but the data are still usable (false).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool MakesDataUnusable()
```

Visual Basic
---
```text
Public Function MakesDataUnusable As Boolean
```

Visual C++
---
```text
public:
bool MakesDataUnusable()
```

# See Also
TessellatedBuildIssue Class
Autodesk.Revit.DB Namespace